class Knowledge {
  String title;
  String image;
  String description;

  Knowledge({
    required this.title,
    required this.image,
    required this.description,
  });
}

Future<List<Knowledge>> fetchKnowledge() async {
  return BuildKnowledge().knowledgeList;
}

class BuildKnowledge {
  List<Knowledge> knowledgeList = [
    Knowledge(
      title: "ระบบสร้างคำสั่งเทรดอัตโนมัติ",
      image:
          "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2019/06/19/838366-robot-representational.jpg",
      description:
          "การทำงานของระบบจะสั่งซื้อตามเงื่อนไขการซื้อขายหุ้นตามที่ผู้ใช้ได้วิเคราะห์หรือต้องการตัวชี้วัดทางเทคนิคไว้ในแต่ละ Timeframe เนื่องจากแต่ละ Timeframe นั้นจะมีค่าตัวชี้วัดทางเทคนิคที่ไม่เหมือนกัน โดยไม่ต้องคอยเฝ้าหน้าจอเพื่อกดซื้อขายหุ้นเอง เช่น ตั้งเงื่อนไขให้ซื้อหุ้น META หาก RSI มีค่าน้อยกว่าหรือเท่ากับ 30 ระบบจะทำการสั่งซื้อตามจำนวนที่ผู้ใช้ต้องการทันที ตั้งเงื่อนไขให้ขายหุ้น PTT หาก MACD ตัดลงและมีค่ามากกว่า 0 ระบบจะทำการสั่งขายตามจำนวนที่ผู้ใช้ต้องการทันที",
    ),
    Knowledge(
      title: "RSI คืออะไร?",
      image: "https://i.ytimg.com/vi/VH84ppzmq9Q/maxresdefault.jpg",
      description:
          "RSI ย่อมาจาก 'Relative Strength Index' ซึ่งเป็นตัวชี้วัดทางเทคนิคที่ใช้ในการวิเคราะห์และประเมินความเปลี่ยนแปลงในราคาของหลักทรัพย์ เครื่องมือนี้ช่วยให้นักลงทุนและผู้ซื้อขายสามารถระบุว่าหลักทรัพย์นั้นมีความแข็งแกร่งหรืออ่อนแอ และว่ามีการซื้อขายที่เกิดขึ้นมากแค่ไหนในระยะเวลาที่กำหนดไว้ \n\nRSI คำนวณจากอัตราส่วนของการเพิ่มขึ้นของราคาที่เป็นบวกกับการลดลงของราคาที่เป็นลบ ซึ่งคำนวณตามสูตรที่ซับซ้อนเล็กน้อย ค่า RSI จะอยู่ในช่วง 0 ถึง 100 โดยทั่วไปแล้วมีเกณฑ์ดังนี้:\n RSI ตั้งแต่ 0 ถึง 30: หมายถึงหลักทรัพย์อาจจะมีการขายเกินไป (oversold) และอาจเป็นสัญญาณว่าอาจมีการกลับขึ้นในอนาคต\n RSI ตั้งแต่ 70 ถึง 100: หมายถึงหลักทรัพย์อาจจะมีการซื้อเกินไป (overbought) และอาจเป็นสัญญาณว่าอาจมีการกลับลงในอนาคต\n RSI ระหว่าง 30 ถึง 70: หมายถึงสภาวะที่สมดุลระหว่างการซื้อและการขาย\n\n วิธีการใช้งาน RSI อย่างเบื้องต้นได้แก่:\n 1.การระบุสัญญาณซื้อขาย: ในกรณีที่ RSI เข้าสู่ช่วง overbought หรือ oversold มากๆ (ค่าต่ำกว่า 30 หรือสูงกว่า 70) อาจเป็นสัญญาณว่าตลาดอาจกำลังพร้อมที่จะกลับซื้อหรือขายตามลำดับ\n 2.การระบุการเปลี่ยนแนวโน้ม: การเปลี่ยนแนวโน้มของ RSI อาจเป็นสัญญาณว่ามีการเปลี่ยนแปลงในแนวโน้มราคาเกิดขึ้น ยกตัวอย่างเช่น RSI ที่เริ่มเพิ่มขึ้นอาจแสดงถึงการเข้าสู่แนวโน้มขาขึ้นของราคา\n",
    ),
    Knowledge(
      title: "STO คืออะไร?",
      image:
          "https://iqtradingpro.com/wp-content/uploads/2021/10/stochastic-indicator.jpg",
      description: ' Stochastic Oscillator (Stochastic) เป็นการใช้ตัวชี้วัดทางเทคนิคมักถูกใช้ในการตรวจสอบว่าราคาอยู่ในสภาวะ "ซื้อเกิน" หรือ "ขายเกิน" และมีโอกาสที่จะเกิดการเปลี่ยนแนวโน้มของตลาด เนื่องจากตัวชี้วัดนี้มีสองส่วนหลักคือ %K และ %D:\n%K (Fast Stochastic): คำนวณจากสูตร (ปิดราคา - ค่าต่ำสุดในช่วงเวลาที่กำหนด) / (ค่าสูงสุดในช่วงเวลาที่กำหนด - ค่าต่ำสุดในช่วงเวลาที่กำหนด) * 100 \n%K จะแสดงค่าเป็นเปอร์เซ็นต์และช่วยในการระบุสภาวะ "ซื้อเกิน" หรือ "ขายเกิน" ในช่วงเวลาที่กำหนด (มักใช้ช่วงเวลา 14 วัน)\n %D (Slow Stochastic): คำนวณจากค่าเฉลี่ยเคลื่อนที่ของ %K ในช่วงเวลาที่กำหนด (มักใช้ช่วงเวลา 3 วัน) %D ช่วยในการลดความเปลี่ยนแปลงของ %K เพื่อให้ได้สัญญาณที่มีความน่าเชื่อถือมากขึ้น \nสรุปการใช้งาน STO ง่ายๆว่า\nเมื่อ %K ต่ำกว่า 20: มีโอกาสที่ราคาจะอยู่ในสภาวะ "ขายเกิน" และสัญญาณ "ซื้อ" อาจเกิดขึ้นเร็วๆ นี้ (การเปลี่ยนแนวโน้มขึ้น)\nเมื่อ %K สูงกว่า 80: มีโอกาสที่ราคาจะอยู่ในสภาวะ "ซื้อเกิน" และสัญญาณ "ขาย" อาจเกิดขึ้นเร็วๆ นี้ (การเปลี่ยนแนวโน้มลง)',
    ),
    Knowledge(
      title: "MACD คืออะไร?",
      image:
          "https://goodcrypto.app/wp-content/uploads/2021/09/MACD-indicator.jpg",
      description: "MACD มีไว้เพื่อประโยชน์ดังนี้",
    ),
    Knowledge(
      title: "EMA คืออะไร?",
      image:
          "https://images.ctfassets.net/hzjmpv1aaorq/LF6vkvvSH2gTEeYAZohVb/362379dd875062eae691afb580543aa6/Blog_Images_-_Skilling.png?q=70",
      description: "EMA ย่อมาจาก Exponential Moving Average คือ เส้นค่าเฉลี่ยเคลื่อนที่แบบเอ็กซ์โพเนนเชียล เป็นการคำนวณประเภทหนึ่งของเส้นค่าเฉลี่ยแบบเคลื่อนที่ (Moving Average: MA) ซึ่งการหาค่าแบบ Exponential จะมองความสัมพันธ์ของราคาหุ้นย้อนหลังแบบถ่วงน้ำหนักในรูปแบบของเลขชี้กำลังโดยให้ความสำคัญกับราคาสุดท้ายมากที่สุด ดังนั้น เส้นค่าเฉลี่ยแบบ EMA จึงเคลื่อนไหวได้เร็วกว่า และตอบสนองต่อการเปลี่ยนแปลงของราคาไวกว่าการคำนวณแบบธรรมดา (Simple Moving Average: SMA) อย่างมีนัยสำคัญ\n\nนักเทคนิคมักใช้สูตรการคำนวณ EMA ที่มีการคำนวณ Period ราคาย้อนหลังแตกต่างกันหลายแบบ เช่น\nค่าเฉลี่ยเคลื่อนที่ 10 วัน (2 สัปดาห์) ใช้สะท้อนการเคลื่อนไหวของราคาหุ้นระยะสั้น\nค่าเฉลี่ยเคลื่อนที่ 25 วัน (5 สัปดาห์) ใช้สะท้อนการเคลื่อนไหวของราคาหุ้นระยะสั้น ถึง ระยะกลาง\nค่าเฉลี่ยเคลื่อนที่ 50 วัน (10 สัปดาห์) ใช้สะท้อนการเคลื่อนไหวของราคาหุ้นระยะกลาง\nค่าเฉลี่ยเคลื่อนที่ 200 วัน (40 สัปดาห์) ใช้สะท้อนการเคลื่อนไหวของราคาหุ้นระยะยาว\n",
    ),
  ];
}
